#### Data

In [17]:
import numpy as np
import pandas as pd

In [18]:
df = pd.read_csv("data3.csv")
df

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

#### Missing Value
* `NA`, `NaN`, `None` and `Missing`

#### Dropping Missing Values

In [19]:
df.dropna(how="all")

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

In [20]:
df.dropna(axis="columns")

       first
0       Jack
1  Sebastian
2       Kimi
3      Lewis

#### Specifically Checking Missing Value of Columns

In [21]:
df.dropna(axis="index", how="any", subset=["age"])

       first    last              email   age
0       Jack     NaN  jackdoe@email.com  34.0
1  Sebastian  Vettel                NaN  32.0

In [22]:
df.dropna(axis="index", how="any", subset=["age", "email"])

  first last              email   age
0  Jack  NaN  jackdoe@email.com  34.0

#### Handling Custom Missing Values
**First Way**

In [23]:
df

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

In [25]:
df.replace("NA", np.nan)

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

In [26]:
df.dropna() # Default olarak indexlerde 1 tane bile bo≈üsa atar

Empty DataFrame
Columns: [first, last, email, age]
Index: []

**Getting Boolean Mask**

In [27]:
df.isna()

   first   last  email    age
0  False   True  False  False
1  False  False   True  False
2  False  False  False   True
3  False  False  False   True

In [29]:
df["email"]

0      jackdoe@email.com
1                    NaN
2     kimibaba@email.com
3    lastikyok@email.com
Name: email, dtype: object

In [30]:
df["email"].isna()

0    False
1     True
2    False
3    False
Name: email, dtype: bool

**Second Way**

In [35]:
na_values = ["NA", "Missing"]
df_survey = pd.read_csv("data3.csv", na_values=na_values)

In [36]:
df_survey

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

#### fillna()

In [37]:
df

       first      last                email   age
0       Jack       NaN    jackdoe@email.com  34.0
1  Sebastian    Vettel                  NaN  32.0
2       Kimi  Raikonen   kimibaba@email.com   NaN
3      Lewis  Hamilton  lastikyok@email.com   NaN

In [38]:
df.fillna("Missing")

       first      last                email      age
0       Jack   Missing    jackdoe@email.com     34.0
1  Sebastian    Vettel              Missing     32.0
2       Kimi  Raikonen   kimibaba@email.com  Missing
3      Lewis  Hamilton  lastikyok@email.com  Missing